create_clock -period 50.000000 -waveform { 0.000000 25.000000 } -name TVP_CLK [ get_ports { TVP_CLK } ]
create_clock -period 20.511999 -waveform { 0.000000 10.256000 } -name TX_CLK [ get_ports { ADV_CLK } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[0] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_VSYNC } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[7] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[6] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[5] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[4] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[3] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[2] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_R[1] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_HSYNC } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[2] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[5] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[1] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[7] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[3] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[6] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[0] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[4] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[7] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_G[6] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_CLK } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[5] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[3] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_BLANK_N } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[2] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[1] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[0] } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_SYNC_N } ]
set_output_delay 17.000000 -max -clock TX_CLK [ get_ports { ADV_B[4] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[0] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_VSYNC } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[7] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[6] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[5] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[4] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[3] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[2] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_R[1] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_HSYNC } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[2] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[5] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[1] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[7] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[3] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[6] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[0] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[4] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[7] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_G[6] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_CLK } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[5] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[3] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_BLANK_N } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[2] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[1] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[0] } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_SYNC_N } ]
set_output_delay 3.000000 -min -clock TX_CLK [ get_ports { ADV_B[4] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[1] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[8] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[7] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_CLK } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[6] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[4] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[9] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[3] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[0] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VSYNC } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[5] } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_HSYNC } ]
set_input_delay 1.500000 -max -clock TVP_CLK [ get_ports { TVP_VIDEO[2] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[1] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[8] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[7] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_CLK } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[6] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[4] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[9] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[3] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[0] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VSYNC } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[5] } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_HSYNC } ]
set_input_delay 0.000000 -min -clock TVP_CLK [ get_ports { TVP_VIDEO[2] } ]
create_clock -period 20.000000 -name clk500 [get_nets ADV_CLK_c]
